Revit 2027 API
FabricationConfiguration.GetItemFolders Method
 Gets a list of fabrication item folders in the fabrication item folder structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationItemFolder> GetItemFolders()
Public Function GetItemFolders As IList(Of FabricationItemFolder)
public:
IList<FabricationItemFolder^>^ GetItemFolders()
member GetItemFolders : unit -> IList<FabricationItemFolder>
Return Value
IList<FabricationItemFolder>
 Returns a list of fabrication item folders in the fabrication item folder structure.
Exceptions
Exception | Condition
InvalidOperationException |  The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Remarks
 To get the item folders, you may need to call ReloadConfiguration first.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace